package bot.tg.helper;


public class MessageHelper {

    private static final String HELP_MESSAGE = """
            Привіт! 👋 Я твій особистий органайзер.
            Я допоможу тобі керувати завданнями та нагадуваннями.
            Ось що я можу:
            
              🟢 /start – Розпочати розмову зі мною.
              🔔 /tasks – Переглянути всі завдання на сьогодні.
              ⏳ /reminders – Переглянути налаштовані нагадування.
              ➕ /newtask – Створити нове завдання на день.
              ➕ /newreminder – Запланувати нове нагадування.
            
              ✏️ Менеджмент завдань – Створюєш завдання та відмічаєш, коли виконав їх. Можна змінювати назву, опис та статус вже створених завдань.
              ⏰ Нагадування – Можна створити нагадування на певну дату та час. Бот сповістить тебе повідомленням, коли прийде час. Також їх можна вимикати/вмикати.
              📆 Інтеграція з Google Calendar – Твої завдання та нагадування створюють події в календарі (за умови надання дозволу).
              🕒 Налаштування часового поясу – Завжди правильний час нагадувань, навіть якщо ти подорожуєш.
              🌅 Ранкові нагадування – Щоранку в обраний тобою час я бажаю тобі гарно провести день!
              ❓Ой, а це ж ти ще не пробував відправити мені стікер.. :)
            
              🌐 Багатомовний інтерфейс (в розробці) – Планується підтримка декількох мов для зручності.
            """;

    private MessageHelper() {}

    public static String formHelpMessage() {
        return HELP_MESSAGE;
    }
}
